<!-- terraform-plan-aws:stage -->
## 🟨 Terraform plan (aws/stage) — Changes detected
**Changes:** +7 ~1 -8
**Time:**
| TZ | Time |
| --- | --- |
| UTC | 2026-03-12, 3:34:09 a.m. |
| NZ | 2026-03-12, 4:34:09 p.m. |
| PT | 2026-03-11, 8:34:09 p.m. |
| ET | 2026-03-11, 11:34:09 p.m. |

Run: https://github.com/JesusFilm/forge/actions/runs/22985360886

```
module.platform.module.application.ephemeral.random_password.dev_app_key_4: Opening...
module.platform.random_password.web_dev_strapi_preview_token[0]: Refreshing state... [id=none]
module.platform.module.application.ephemeral.random_password.encryption_key: Opening...
module.platform.random_password.web_dev_strapi_revalidate_token[0]: Refreshing state... [id=none]
module.platform.module.application.ephemeral.random_password.dev_encryption_key: Opening...
module.platform.module.application.ephemeral.random_password.app_key_3: Opening...
module.platform.module.application.ephemeral.random_password.app_key_1: Opening...
module.platform.random_password.web_dev_strapi_api_token[0]: Refreshing state... [id=none]
module.platform.module.application.ephemeral.random_password.dev_api_token_salt: Opening...
module.platform.module.application.ephemeral.random_password.dev_transfer_token_salt: Opening...
module.platform.module.application.ephemeral.random_password.dev_api_token_salt: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.preview_secret: Opening...
module.platform.module.application.ephemeral.random_password.dev_app_key_4: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.dev_transfer_token_salt: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.encryption_key: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_1: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.strapi_internal_api_token: Opening...
module.platform.module.application.ephemeral.random_password.app_key_2: Opening...
module.platform.module.application.ephemeral.random_password.app_key_4: Opening...
module.platform.module.application.ephemeral.random_password.admin_jwt_secret: Opening...
module.platform.module.application.ephemeral.random_password.dev_admin_jwt_secret: Opening...
module.platform.module.application.ephemeral.random_password.app_key_3: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.dev_jwt_secret: Opening...
module.platform.module.application.ephemeral.random_password.dev_encryption_key: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.jwt_secret: Opening...
module.platform.module.application.ephemeral.random_password.api_token_salt: Opening...
module.platform.module.application.ephemeral.random_password.preview_secret: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.admin_jwt_secret: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_2: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.transfer_token_salt: Opening...
module.platform.module.application.ephemeral.random_password.strapi_internal_api_token: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.dev_strapi_internal_api_token: Opening...
module.platform.module.application.ephemeral.random_password.dev_app_key_2: Opening...
module.platform.module.application.ephemeral.random_password.app_key_4: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.dev_app_key_3: Opening...
module.platform.module.application.ephemeral.random_password.dev_jwt_secret: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.jwt_secret: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.dev_admin_jwt_secret: Opening complete after 0s
module.platform.module.application.ephemeral.random_password.dev_preview_secret: Opening...
module.platform.module.application.ephemeral.random_password.dev_app_key_1: Opening...
module.platform.module.assets.aws_acm_certificate.assets: Refreshing state... [id=arn:aws:acm:us-east-1:031374266475:certificate/78e7de72-ab8b-49f4-a40a-02bb7c0d4f4e]
module.platform.module.application.aws_iam_role.ecs_task: Refreshing state... [id=forge-cms-stage-task-role]
module.platform.module.application.aws_cloudwatch_log_group.cms: Refreshing state... [id=/ecs/forge-cms-stage]
module.platform.module.application.ephemeral.random_password.dev_strapi_internal_api_token: Opening complete after 0s
module.platform.aws_ssm_parameter.web_dev_next_public_graphql_url[0]: Refreshing state... [id=/forge/aws/web/dev/NEXT_PUBLIC_GRAPHQL_URL]
module.platform.module.application.ephemeral.random_password.api_token_salt: Opening complete after 0s
module.platform.aws_ssm_parameter.web_dev_strapi_api_token[0]: Refreshing state... [id=/forge/aws/web/dev/STRAPI_API_TOKEN]
module.platform.module.application.ephemeral.random_password.transfer_token_salt: Opening complete after 0s
module.platform.aws_ssm_parameter.web_dev_strapi_revalidate_token[0]: Refreshing state... [id=/forge/aws/web/dev/STRAPI_REVALIDATE_TOKEN]
module.platform.module.application.ephemeral.random_password.dev_app_key_1: Opening complete after 0s
module.platform.aws_ssm_parameter.web_dev_strapi_preview_token[0]: Refreshing state... [id=/forge/aws/web/dev/STRAPI_PREVIEW_TOKEN]
module.platform.module.application.ephemeral.random_password.dev_app_key_2: Opening complete after 0s
module.platform.aws_kms_alias.web_dev_ssm[0]: Refreshing state... [id=alias/forge-web-dev-ssm]
module.platform.module.application.ephemeral.random_password.dev_app_key_3: Opening complete after 0s
module.platform.module.application.aws_iam_role.ecs_execution: Refreshing state... [id=forge-cms-stage-execution-role]
module.platform.module.application.ephemeral.random_password.dev_preview_secret: Opening complete after 0s
module.platform.module.application.aws_ecr_repository.cms: Refreshing state... [id=forge-cms-stage]
module.platform.module.assets.aws_s3_bucket.assets: Refreshing state... [id=forge-cms-stage-assets]
module.platform.module.assets.aws_s3_bucket.assets_access_logs: Refreshing state... [id=forge-cms-stage-assets-access-logs]
module.platform.module.assets.aws_kms_key.assets: Refreshing state... [id=ebf807b3-624c-4a0f-9e6f-4c08f0eaff3e]
module.platform.module.application.aws_acm_certificate.alb: Refreshing state... [id=arn:aws:acm:us-east-2:031374266475:certificate/a62eb55a-e4cf-4375-adb1-a73b5232f28a]
module.platform.aws_s3_bucket.alb_logs: Refreshing state... [id=forge-platform-stage-alb-logs]
module.platform.module.assets.aws_cloudfront_origin_access_control.assets: Refreshing state... [id=E2LML7ZZ1C2D9R]
module.platform.aws_vpc.platform: Refreshing state... [id=vpc-0040ec9fef124ece4]
module.platform.aws_cloudwatch_log_group.waf: Refreshing state... [id=aws-waf-logs-forge-platform-stage]
module.platform.module.assets.data.aws_caller_identity.current: Reading...
module.platform.module.assets.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.github.data.aws_kms_alias.terraform_state: Reading...
module.github.data.aws_iam_policy.github_actions_terraform_apply[0]: Reading...
module.github.data.aws_caller_identity.current: Reading...
module.github.data.aws_kms_alias.terraform_state: Read complete after 0s [id=arn:aws:kms:us-east-2:031374266475:alias/forge-terraform-state]
data.aws_route53_zone.forge[0]: Reading...
module.github.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.platform.data.aws_availability_zones.available: Reading...
module.github.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::031374266475:oidc-provider/token.actions.githubusercontent.com]
module.platform.aws_eip.nat: Refreshing state... [id=eipalloc-0895205d6a27b7bee]
module.platform.module.application.aws_ecs_cluster.cms: Refreshing state... [id=arn:aws:ecs:us-east-2:031374266475:cluster/forge-cms-stage]
module.platform.data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.platform.data.aws_caller_identity.current: Reading...
module.platform.data.aws_caller_identity.current: Read complete after 0s [id=031374266475]
module.github.data.aws_iam_policy_document.github_actions_terraform_apply: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_apply: Read complete after 0s [id=1914455514]
data.aws_dynamodb_table.terraform_state_lock: Reading...
module.platform.module.application.aws_kms_key.cms_ssm: Refreshing state... [id=5936d262-64d2-447d-8c57-2c8536b7c793]
module.platform.module.assets.aws_kms_alias.assets: Refreshing state... [id=alias/forge-cms-stage-assets]
module.platform.module.application.aws_iam_role_policy_attachment.ecs_execution: Refreshing state... [id=forge-cms-stage-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
module.github.data.aws_kms_key.terraform_state: Reading...
data.aws_route53_zone.forge[0]: Read complete after 0s [id=Z078031724OHPW03IKVLO]
module.github.data.aws_iam_policy_document.github_actions_cms_deploy: Reading...
module.github.data.aws_iam_policy_document.github_actions_cms_deploy: Read complete after 0s [id=3739488026]
module.github.data.aws_iam_policy_document.github_actions_terraform_apply_assume_role: Reading...
module.github.data.aws_iam_policy_document.github_actions_assume_role: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_apply_assume_role: Read complete after 0s [id=4015899160]
module.github.data.aws_iam_policy_document.github_actions_assume_role: Read complete after 0s [id=754675411]
module.github.data.aws_kms_key.terraform_state: Read complete after 0s [id=68220f21-2ca1-4846-9c2a-c8b6e268e63c]
module.github.data.aws_iam_policy_document.github_actions_terraform_plan_assume_role: Reading...
data.aws_s3_bucket.terraform_state: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_plan_assume_role: Read complete after 0s [id=309924271]
module.platform.module.application.aws_kms_alias.cms_ssm: Refreshing state... [id=alias/forge-cms-stage-ssm]
module.platform.module.application.aws_ssm_parameter.encryption_key: Refreshing state... [id=/forge/aws/cms/stage/ENCRYPTION_KEY]
module.platform.module.application.aws_ssm_parameter.dev_app_keys[0]: Refreshing state... [id=/forge/aws/cms/dev/APP_KEYS]
module.platform.module.application.aws_ssm_parameter.app_keys: Refreshing state... [id=/forge/aws/cms/stage/APP_KEYS]
module.platform.module.application.aws_ssm_parameter.dev_api_token_salt[0]: Refreshing state... [id=/forge/aws/cms/dev/API_TOKEN_SALT]
module.platform.module.application.aws_ssm_parameter.dev_admin_jwt_secret[0]: Refreshing state... [id=/forge/aws/cms/dev/ADMIN_JWT_SECRET]
module.platform.aws_wafv2_web_acl.alb: Refreshing state... [id=efb05d09-b544-4c38-995e-b646ec91dd29]
data.aws_dynamodb_table.terraform_state_lock: Read complete after 0s [id=forge-terraform-locks]
module.platform.module.application.aws_ssm_parameter.transfer_token_salt: Refreshing state... [id=/forge/aws/cms/stage/TRANSFER_TOKEN_SALT]
data.aws_s3_bucket.terraform_state: Read complete after 1s [id=forge-terraform-state-031374266475]
module.platform.module.application.aws_ssm_parameter.api_token_salt: Refreshing state... [id=/forge/aws/cms/stage/API_TOKEN_SALT]
module.platform.module.application.aws_kms_alias.cms_dev_ssm[0]: Refreshing state... [id=alias/forge-cms-dev-ssm]
module.platform.module.application.aws_ssm_parameter.jwt_secret: Refreshing state... [id=/forge/aws/cms/stage/JWT_SECRET]
module.github.data.aws_iam_policy.github_actions_terraform_apply[0]: Read complete after 1s [id=arn:aws:iam::031374266475:policy/forge-github-actions-terraform-apply]
module.platform.module.application.aws_ssm_parameter.dev_jwt_secret[0]: Refreshing state... [id=/forge/aws/cms/dev/JWT_SECRET]
module.platform.module.application.aws_ssm_parameter.dev_encryption_key[0]: Refreshing state... [id=/forge/aws/cms/dev/ENCRYPTION_KEY]
module.platform.module.application.aws_ssm_parameter.admin_jwt_secret: Refreshing state... [id=/forge/aws/cms/stage/ADMIN_JWT_SECRET]
module.platform.module.application.aws_ssm_parameter.strapi_internal_api_token: Refreshing state... [id=/forge/aws/cms/stage/STRAPI_INTERNAL_API_TOKEN]
module.platform.module.application.aws_ssm_parameter.dev_transfer_token_salt[0]: Refreshing state... [id=/forge/aws/cms/dev/TRANSFER_TOKEN_SALT]
module.github.aws_iam_role.github_actions_terraform_apply: Refreshing state... [id=forge-github-actions-terraform-apply-stage]
module.github.aws_iam_role.github_actions_cms_deploy: Refreshing state... [id=forge-github-actions-cms-deploy-stage]
module.github.aws_iam_role.github_actions_terraform_plan: Refreshing state... [id=forge-github-actions-terraform-plan-stage]
module.platform.module.application.ephemeral.random_password.preview_secret: Closing...
module.platform.module.application.ephemeral.random_password.preview_secret: Closing complete after 0s
module.platform.module.assets.aws_s3_bucket_server_side_encryption_configuration.assets: Refreshing state... [id=forge-cms-stage-assets]
module.platform.module.assets.aws_s3_bucket_cors_configuration.assets: Refreshing state... [id=forge-cms-stage-assets]
module.platform.module.assets.aws_s3_bucket_versioning.assets: Refreshing state... [id=forge-cms-stage-assets]
module.platform.module.assets.aws_s3_bucket_public_access_block.assets: Refreshing state... [id=forge-cms-stage-assets]
module.platform.module.application.ephemeral.random_password.dev_strapi_internal_api_token: Closing...
module.platform.module.application.ephemeral.random_password.dev_strapi_internal_api_token: Closing complete after 0s
module.platform.module.assets.aws_s3_bucket_lifecycle_configuration.assets_access_logs: Refreshing state... [id=forge-cms-stage-assets-access-logs]
module.platform.module.assets.aws_s3_bucket_server_side_encryption_configuration.assets_access_logs: Refreshing state... [id=forge-cms-stage-assets-access-logs]
module.platform.module.assets.data.aws_iam_policy_document.assets_access_logs: Reading...
module.platform.module.assets.data.aws_iam_policy_document.assets_access_logs: Read complete after 0s [id=323064003]
module.platform.module.assets.aws_s3_bucket_logging.assets: Refreshing state... [id=forge-cms-stage-assets]
module.platform.module.assets.aws_s3_bucket_public_access_block.assets_access_logs: Refreshing state... [id=forge-cms-stage-assets-access-logs]
module.platform.aws_s3_bucket_versioning.alb_logs: Refreshing state... [id=forge-platform-stage-alb-logs]
module.platform.aws_s3_bucket_server_side_encryption_configuration.alb_logs: Refreshing state... [id=forge-platform-stage-alb-logs]
module.platform.aws_s3_bucket_public_access_block.alb_logs: Refreshing state... [id=forge-platform-stage-alb-logs]
module.platform.data.aws_iam_policy_document.alb_logs: Reading...
module.platform.data.aws_iam_policy_document.alb_logs: Read complete after 0s [id=1858962669]
module.platform.aws_s3_bucket_lifecycle_configuration.alb_logs: Refreshing state... [id=forge-platform-stage-alb-logs]
module.platform.aws_internet_gateway.platform: Refreshing state... [id=igw-0dca6115df12a416c]
module.platform.aws_subnet.public[1]: Refreshing state... [id=subnet-0650937425d48dd8f]
module.platform.aws_subnet.public[0]: Refreshing state... [id=subnet-0ae5cc72794571e47]
module.platform.aws_security_group.ecs_service: Refreshing state... [id=sg-0c75adbe59945b2e2]
module.platform.aws_security_group.alb: Refreshing state... [id=sg-0075aef920fa1e986]
module.platform.aws_subnet.private[1]: Refreshing state... [id=subnet-08acf4d6a0cf91289]
module.platform.aws_subnet.private[0]: Refreshing state... [id=subnet-08cb983444108cad4]
module.platform.module.application.ephemeral.random_password.dev_preview_secret: Closing...
module.platform.module.application.ephemeral.random_password.dev_preview_secret: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.dev_encryption_key: Closing...
module.platform.module.application.ephemeral.random_password.dev_encryption_key: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.dev_api_token_salt: Closing...
module.platform.module.application.ephemeral.random_password.dev_api_token_salt: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.dev_admin_jwt_secret: Closing...
module.platform.module.application.ephemeral.random_password.dev_admin_jwt_secret: Closing complete after 0s
module.github.aws_ssm_parameter.terraform_aws_role_apply_arn: Refreshing state... [id=/forge/github/terraform_aws_role_apply_stage_arn]
module.github.aws_ssm_parameter.cms_deploy_role_arn: Refreshing state... [id=/forge/github/cms_deploy_role_arn_stage]
module.github.aws_iam_role_policy.github_actions_cms_deploy: Refreshing state... [id=forge-github-actions-cms-deploy-stage:cms-deploy]
module.github.aws_ssm_parameter.terraform_aws_role_plan_arn: Refreshing state... [id=/forge/github/terraform_aws_role_plan_stage_arn]
module.github.aws_iam_role_policy_attachment.github_actions_terraform_plan_readonly: Refreshing state... [id=forge-github-actions-terraform-plan-stage/arn:aws:iam::aws:policy/ReadOnlyAccess]
module.platform.module.assets.aws_s3_bucket_policy.assets_access_logs: Refreshing state... [id=forge-cms-stage-assets-access-logs]
module.platform.module.application.ephemeral.random_password.dev_transfer_token_salt: Closing...
module.platform.module.application.ephemeral.random_password.dev_transfer_token_salt: Closing complete after 0s
module.platform.aws_wafv2_web_acl_logging_configuration.alb: Refreshing state... [id=arn:aws:wafv2:us-east-2:031374266475:regional/webacl/forge-platform-stage-waf/efb05d09-b544-4c38-995e-b646ec91dd29]
module.platform.aws_s3_bucket_policy.alb_logs: Refreshing state... [id=forge-platform-stage-alb-logs]
module.platform.module.application.aws_lb_target_group.cms: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:targetgroup/forge-cms-stage-tg/73976e5b63c4370d]
module.platform.aws_route_table.public: Refreshing state... [id=rtb-02f919913a845c8a3]
module.platform.aws_nat_gateway.platform: Refreshing state... [id=nat-025e58577ccb794fa]
module.platform.aws_security_group.rds: Refreshing state... [id=sg-0224a96f3740f4537]
module.github.aws_iam_role_policy_attachment.github_actions_terraform_apply: Refreshing state... [id=forge-github-actions-terraform-apply-stage/arn:aws:iam::031374266475:policy/forge-github-actions-terraform-apply]
module.platform.aws_lb.platform: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:loadbalancer/app/forge-platform-stage-alb/dc88600f279821b0]
module.github.data.aws_iam_policy_document.github_actions_terraform_plan_ssm_kms: Reading...
module.github.data.aws_iam_policy_document.github_actions_terraform_plan_ssm_kms: Read complete after 0s [id=206155691]
module.platform.module.application.data.aws_iam_policy_document.ecs_task: Reading...
module.platform.module.application.data.aws_iam_policy_document.ecs_task: Read complete after 0s [id=2019633846]
module.platform.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a95ea0dfe84fc92b]
module.platform.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05ab32ccd7e67f90f]
module.platform.module.assets.aws_route53_record.assets_cert_validation["assets.stage.forge.jesusfilm.org"]: Refreshing state... [id=Z078031724OHPW03IKVLO__119fbb353ee3dad6d705782901195439.assets.stage.forge.jesusfilm.org._CNAME]
module.platform.module.application.aws_route53_record.alb_cert_validation["cms.stage.forge.jesusfilm.org"]: Refreshing state... [id=Z078031724OHPW03IKVLO__8c049a04c1fcb9caa395b6ff6c2322ab.cms.stage.forge.jesusfilm.org._CNAME]
module.platform.module.application.aws_vpc_security_group_egress_rule.alb_to_cms: Refreshing state... [id=sgr-06fda286a79c919bb]
module.platform.module.application.aws_vpc_security_group_ingress_rule.cms_from_alb: Refreshing state... [id=sgr-028258e5908101779]
module.platform.aws_route_table.private: Refreshing state... [id=rtb-090fd093fd497c232]
module.platform.module.application.aws_db_subnet_group.cms: Refreshing state... [id=forge-cms-stage-db-subnets]
module.github.aws_iam_role_policy.github_actions_terraform_plan_ssm_kms: Refreshing state... [id=forge-github-actions-terraform-plan-stage:terraform-plan-ssm-kms]
module.platform.module.application.aws_iam_role_policy.ecs_task: Refreshing state... [id=forge-cms-stage-task-role:forge-cms-stage-task-policy]
module.platform.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03f8ffd18d6d6b8e7]
module.platform.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-03a23da7dfede2b5c]
module.platform.module.application.aws_acm_certificate_validation.alb: Refreshing state... [id=2026-03-05 08:15:50.293 +0000 UTC]
module.platform.module.assets.aws_acm_certificate_validation.assets: Refreshing state... [id=2026-03-05 08:15:45.225 +0000 UTC]
module.platform.aws_wafv2_web_acl_association.alb: Refreshing state... [id=arn:aws:wafv2:us-east-2:031374266475:regional/webacl/forge-platform-stage-waf/efb05d09-b544-4c38-995e-b646ec91dd29,arn:aws:elasticloadbalancing:us-east-2:031374266475:loadbalancer/app/forge-platform-stage-alb/dc88600f279821b0]
module.platform.module.application.aws_route53_record.alb_alias: Refreshing state... [id=Z078031724OHPW03IKVLO_cms.stage.forge.jesusfilm.org_A]
module.platform.aws_lb_listener.http_redirect: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:listener/app/forge-platform-stage-alb/dc88600f279821b0/9afbee052137b89b]
module.platform.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:listener/app/forge-platform-stage-alb/dc88600f279821b0/96798e67efb942a4]
module.platform.module.assets.aws_cloudfront_distribution.assets: Refreshing state... [id=EJWPGU8999NAE]
module.platform.module.application.aws_db_instance.cms: Refreshing state... [id=db-IFW2HVA2RR22XVOXSTKMLAALH4]
module.platform.module.application.aws_lb_listener_rule.cms_host: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:031374266475:listener-rule/app/forge-platform-stage-alb/dc88600f279821b0/96798e67efb942a4/44dd4fd01dabc8c2]
module.platform.module.application.aws_ecs_task_definition.cms: Refreshing state... [id=forge-cms-stage-task]
module.platform.module.application.data.aws_iam_policy_document.ecs_execution_secrets: Reading...
module.platform.module.application.data.aws_iam_policy_document.ecs_execution_secrets: Read complete after 0s [id=2752775232]
module.platform.module.application.aws_iam_role_policy.ecs_execution_secrets: Refreshing state... [id=forge-cms-stage-execution-role:forge-cms-stage-execution-secrets]
module.platform.module.application.aws_ecs_service.cms: Refreshing state... [id=arn:aws:ecs:us-east-2:031374266475:service/forge-cms-stage/forge-cms-stage-service]
module.platform.module.assets.data.aws_iam_policy_document.assets_bucket: Reading...
module.platform.module.assets.aws_route53_record.assets_alias: Refreshing state... [id=Z078031724OHPW03IKVLO_assets.stage.forge.jesusfilm.org_A]
module.platform.module.assets.data.aws_iam_policy_document.assets_bucket: Read complete after 0s [id=2742714030]
module.platform.module.assets.aws_s3_bucket_policy.assets: Refreshing state... [id=forge-cms-stage-assets]
module.platform.module.application.ephemeral.random_password.app_key_4: Closing...
module.platform.module.application.ephemeral.random_password.encryption_key: Closing...
module.platform.module.application.ephemeral.random_password.admin_jwt_secret: Closing...
module.platform.module.application.ephemeral.random_password.transfer_token_salt: Closing...
module.platform.module.application.ephemeral.random_password.app_key_1: Closing...
module.platform.module.application.ephemeral.random_password.app_key_3: Closing...
module.platform.module.application.ephemeral.random_password.jwt_secret: Closing...
module.platform.module.application.ephemeral.random_password.app_key_3: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.admin_jwt_secret: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.encryption_key: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.jwt_secret: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.transfer_token_salt: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_1: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_4: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.strapi_internal_api_token: Closing...
module.platform.module.application.ephemeral.random_password.strapi_internal_api_token: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.app_key_2: Closing...
module.platform.module.application.ephemeral.random_password.app_key_2: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.api_token_salt: Closing...
module.platform.module.application.ephemeral.random_password.api_token_salt: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.dev_jwt_secret: Closing...
module.platform.module.application.ephemeral.random_password.dev_jwt_secret: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.dev_app_key_1: Closing...
module.platform.module.application.ephemeral.random_password.dev_app_key_4: Closing...
module.platform.module.application.ephemeral.random_password.dev_app_key_3: Closing...
module.platform.module.application.ephemeral.random_password.dev_app_key_2: Closing...
module.platform.module.application.ephemeral.random_password.dev_app_key_4: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.dev_app_key_2: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.dev_app_key_1: Closing complete after 0s
module.platform.module.application.ephemeral.random_password.dev_app_key_3: Closing complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.github.aws_iam_role_policy.github_actions_cms_deploy will be updated in-place
  ~ resource "aws_iam_role_policy" "github_actions_cms_deploy" {
        id          = "forge-github-actions-cms-deploy-stage:cms-deploy"
        name        = "cms-deploy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                    # (4 unchanged elements hidden)
                    {
                        Action   = [
                            "ecs:UpdateService",
                            "ecs:TagResource",
                            "ecs:RegisterTaskDefinition",
                            "ecs:DescribeServices",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ecs:us-east-2:031374266475:task-definition/forge-cms-stage-task*",
                            "arn:aws:ecs:us-east-2:031374266475:service/forge-cms-stage/forge-cms-stage-service",
                            "arn:aws:ecs:us-east-2:031374266475:cluster/forge-cms-stage",
                        ]
                        Sid      = "EcsDeploy"
                    },
                  + {
                      + Action   = "ecs:ListTasks"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "EcsListTasks"
                    },
                  + {
                      + Action   = "ecs:DescribeTasks"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:us-east-2:031374266475:task/forge-cms-stage/*"
                      + Sid      = "EcsDescribeStoppedTasks"
                    },
                  + {
                      + Action   = "logs:GetLogEvents"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:us-east-2:031374266475:log-group:/ecs/forge-cms-stage:*"
                      + Sid      = "CloudWatchLogsReadTaskLogs"
                    },
                    {
                        Action    = "iam:PassRole"
                        Condition = {
                            StringEquals = {
                                "iam:PassedToService" = "ecs-tasks.amazonaws.com"
                            }
                        }
                        Effect    = "Allow"
                        Resource  = [
                            "arn:aws:iam::031374266475:role/forge-cms-stage-task-role",
                            "arn:aws:iam::031374266475:role/forge-cms-stage-execution-role",
                        ]
                        Sid       = "IamPassRolesForEcsTasks"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.platform.aws_kms_alias.web_dev_ssm[0] will be destroyed
  # (because aws_kms_alias.web_dev_ssm is not in configuration)
  - resource "aws_kms_alias" "web_dev_ssm" {
      - arn            = "arn:aws:kms:us-east-2:031374266475:alias/forge-web-dev-ssm" -> null
      - id             = "alias/forge-web-dev-ssm" -> null
      - name           = "alias/forge-web-dev-ssm" -> null
      - region         = "us-east-2" -> null
      - target_key_arn = "arn:aws:kms:us-east-2:031374266475:key/5936d262-64d2-447d-8c57-2c8536b7c793" -> null
      - target_key_id  = "5936d262-64d2-447d-8c57-2c8536b7c793" -> null
        # (1 unchanged attribute hidden)
    }

  # module.platform.aws_ssm_parameter.web_dev_next_public_graphql_url[0] will be destroyed
  # (because aws_ssm_parameter.web_dev_next_public_graphql_url is not in configuration)
  - resource "aws_ssm_parameter" "web_dev_next_public_graphql_url" {
      - arn             = "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/web/dev/NEXT_PUBLIC_GRAPHQL_URL" -> null
      - data_type       = "text" -> null
      - has_value_wo    = false -> null
      - id              = "/forge/aws/web/dev/NEXT_PUBLIC_GRAPHQL_URL" -> null
      - name            = "/forge/aws/web/dev/NEXT_PUBLIC_GRAPHQL_URL" -> null
      - region          = "us-east-2" -> null
      - tags            = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Service"     = "web"
        } -> null
      - tags_all        = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Service"     = "web"
        } -> null
      - tier            = "Standard" -> null
      - type            = "String" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 1 -> null
        # (3 unchanged attributes hidden)
    }

  # module.platform.aws_ssm_parameter.web_dev_strapi_api_token[0] will be destroyed
  # (because aws_ssm_parameter.web_dev_strapi_api_token is not in configuration)
  - resource "aws_ssm_parameter" "web_dev_strapi_api_token" {
      - arn             = "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/web/dev/STRAPI_API_TOKEN" -> null
      - data_type       = "text" -> null
      - has_value_wo    = false -> null
      - id              = "/forge/aws/web/dev/STRAPI_API_TOKEN" -> null
      - key_id          = "arn:aws:kms:us-east-2:031374266475:key/5936d262-64d2-447d-8c57-2c8536b7c793" -> null
      - name            = "/forge/aws/web/dev/STRAPI_API_TOKEN" -> null
      - region          = "us-east-2" -> null
      - tags            = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Service"     = "web"
        } -> null
      - tags_all        = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Service"     = "web"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 1 -> null
        # (2 unchanged attributes hidden)
    }

  # module.platform.aws_ssm_parameter.web_dev_strapi_preview_token[0] will be destroyed
  # (because aws_ssm_parameter.web_dev_strapi_preview_token is not in configuration)
  - resource "aws_ssm_parameter" "web_dev_strapi_preview_token" {
      - arn             = "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/web/dev/STRAPI_PREVIEW_TOKEN" -> null
      - data_type       = "text" -> null
      - has_value_wo    = false -> null
      - id              = "/forge/aws/web/dev/STRAPI_PREVIEW_TOKEN" -> null
      - key_id          = "arn:aws:kms:us-east-2:031374266475:key/5936d262-64d2-447d-8c57-2c8536b7c793" -> null
      - name            = "/forge/aws/web/dev/STRAPI_PREVIEW_TOKEN" -> null
      - region          = "us-east-2" -> null
      - tags            = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Service"     = "web"
        } -> null
      - tags_all        = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Service"     = "web"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 1 -> null
        # (2 unchanged attributes hidden)
    }

  # module.platform.aws_ssm_parameter.web_dev_strapi_revalidate_token[0] will be destroyed
  # (because aws_ssm_parameter.web_dev_strapi_revalidate_token is not in configuration)
  - resource "aws_ssm_parameter" "web_dev_strapi_revalidate_token" {
      - arn             = "arn:aws:ssm:us-east-2:031374266475:parameter/forge/aws/web/dev/STRAPI_REVALIDATE_TOKEN" -> null
      - data_type       = "text" -> null
      - has_value_wo    = false -> null
      - id              = "/forge/aws/web/dev/STRAPI_REVALIDATE_TOKEN" -> null
      - key_id          = "arn:aws:kms:us-east-2:031374266475:key/5936d262-64d2-447d-8c57-2c8536b7c793" -> null
      - name            = "/forge/aws/web/dev/STRAPI_REVALIDATE_TOKEN" -> null
      - region          = "us-east-2" -> null
      - tags            = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Service"     = "web"
        } -> null
      - tags_all        = {
          - "Environment" = "dev"
          - "ManagedBy"   = "terraform"
          - "Service"     = "web"
        } -> null
      - tier            = "Standard" -> null
      - type            = "SecureString" -> null
      - value           = (sensitive value) -> null
      - value_wo        = (write-only attribute) -> null
      - version         = 1 -> null
        # (2 unchanged attributes hidden)
    }

  # module.platform.random_password.web_dev_strapi_api_token[0] will be destroyed
  # (because random_password.web_dev_strapi_api_token is not in configuration)
  - resource "random_password" "web_dev_strapi_api_token" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 64 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.platform.random_password.web_dev_strapi_preview_token[0] will be destroyed
  # (because random_password.web_dev_strapi_preview_token is not in configuration)
  - resource "random_password" "web_dev_strapi_preview_token" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 64 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.platform.random_password.web_dev_strapi_revalidate_token[0] will be destroyed
  # (because random_password.web_dev_strapi_revalidate_token is not in configuration)
  - resource "random_password" "web_dev_strapi_revalidate_token" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 64 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.platform.module.application.aws_ssm_parameter.dev_preview_secret[0] will be created
  + resource "aws_ssm_parameter" "dev_preview_secret" {
      + arn              = (known after apply)
      + data_type        = (known after apply)
      + has_value_wo     = (known after apply)
      + id               = (known after apply)
      + insecure_value   = (known after apply)
      + key_id           = "arn:aws:kms:us-east-2:031374266475:key/5936d262-64d2-447d-8c57-2c8536b7c793"
      + name             = "/forge/aws/cms/dev/PREVIEW_SECRET"
      + region           = "us-east-2"
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Service"     = "cms"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Service"     = "cms"
        }
      + tier             = (known after apply)
      + type             = "SecureString"
      + value            = (sensitive value)
      + value_wo         = (write-only attribute)
      + value_wo_version = 1
      + version          = (known after apply)
    }

  # module.platform.module.application.aws_ssm_parameter.dev_strapi_internal_api_token[0] will be created
  + resource "aws_ssm_parameter" "dev_strapi_internal_api_token" {
      + arn              = (known after apply)
      + data_type        = (known after apply)
      + has_value_wo     = (known after apply)
      + id               = (known after apply)
      + insecure_value   = (known after apply)
      + key_id           = "arn:aws:kms:us-east-2:031374266475:key/5936d262-64d2-447d-8c57-2c8536b7c793"
      + name             = "/forge/aws/cms/dev/STRAPI_INTERNAL_API_TOKEN"
      + region           = "us-east-2"
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Service"     = "cms"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Service"     = "cms"
        }
      + tier             = (known after apply)
      + type             = "SecureString"
      + value            = (sensitive value)
      + value_wo         = (write-only attribute)
      + value_wo_version = 1
      + version          = (known after apply)
    }

  # module.platform.module.application.aws_ssm_parameter.preview_secret will be created
  + resource "aws_ssm_parameter" "preview_secret" {
      + arn              = (known after apply)
      + data_type        = (known after apply)
      + has_value_wo     = (known after apply)
      + id               = (known after apply)
      + insecure_value   = (known after apply)
      + key_id           = "arn:aws:kms:us-east-2:031374266475:key/5936d262-64d2-447d-8c57-2c8536b7c793"
      + name             = "/forge/aws/cms/stage/PREVIEW_SECRET"
      + region           = "us-east-2"
      + tags             = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Service"     = "cms"
        }
      + tags_all         = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Service"     = "cms"
        }
      + tier             = (known after apply)
      + type             = "SecureString"
      + value            = (sensitive value)
      + value_wo         = (write-only attribute)
      + value_wo_version = 1
      + version          = (known after apply)
    }

  # module.platform.module.web.aws_kms_alias.web_dev_ssm[0] will be created
  + resource "aws_kms_alias" "web_dev_ssm" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/forge-web-dev-ssm"
      + name_prefix    = (known after apply)
      + region         = "us-east-2"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.platform.module.web.aws_kms_alias.web_ssm will be created
  + resource "aws_kms_alias" "web_ssm" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/forge-web-stage-ssm"
      + name_prefix    = (known after apply)
      + region         = "us-east-2"
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.platform.module.web.aws_kms_key.web_ssm will be created
  + resource "aws_kms_key" "web_ssm" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for web SSM parameters"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + region                             = "us-east-2"
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-web-stage-ssm-kms"
          + "Service"     = "web"
        }
      + tags_all                           = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "forge-web-stage-ssm-kms"
          + "Service"     = "web"
        }
    }

  # module.platform.module.web.aws_ssm_parameter.web_dev_next_public_graphql_url[0] will be created
  + resource "aws_ssm_parameter" "web_dev_next_public_graphql_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/forge/aws/web/dev/NEXT_PUBLIC_GRAPHQL_URL"
      + region         = "us-east-2"
      + tags           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Service"     = "web"
        }
      + tags_all       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Service"     = "web"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 7 to add, 1 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```